docs/desktop.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>desktop</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org63d5fc1">
<div class="navbar-brand" id="org8dec4ca">
<div class="navbar-item" id="orgfa43d21">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="orgc21e7eb">
<div class="navbar-start" id="org88ed688">
<div class="navbar-item" id="orgfe11603">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="orgaecb87b">

</div>

</div>
</nav>
<div id="outline-container-org3d9a08a" class="outline-2">
<h2 id="org3d9a08a">Desktop</h2>
<div class="outline-text-2" id="text-org3d9a08a">
<p>
More ricing less productivity!
</p>
<ul class="org-ul">
<li>gdm
<ul class="org-ul">
<li>gnome display manager</li>
</ul></li>
<li>sddm
<ul class="org-ul">
<li>kde desktop manager (simple desktop display manager)</li>
</ul></li>
<li>lightdm
<ul class="org-ul">
<li>usually xfce's display manager</li>
</ul></li>
<li>Cross desktop vars for configuration are XDG vars
<ul class="org-ul">
<li><code>XDG_DATA_HOME XDG_CONFIG_HOME XDG_STATE_HOME XDG_RUNTIME_DIR XDG_CACHE_HOME XDG_CONFIG_DIRS XDG_DATA_DIRS</code></li>
</ul></li>
<li>xfce
<ul class="org-ul">
<li>simple but lacks wayland support (planned some for 4.18 xfwm support?)</li>
</ul></li>
<li>gnome
<ul class="org-ul">
<li>javascript based desktop (leaked memory)</li>
</ul></li>
<li>kde
<ul class="org-ul">
<li>manjaro desktop package is plasma-meta
<ul class="org-ul">
<li>added konsole, unarchiver, kio-admin, gnustep-base, dolphin, ark, sweeper, sddm-breath-theme</li>
</ul></li>
<li>qt based
<ul class="org-ul">
<li>qt project withholds patches for up to a year</li>
</ul></li>
</ul></li>
<li>aero (windows)</li>
<li>quartz (mac)</li>
<li>gamescope compositor for wayland desktops supports experimental HDR</li>
</ul>
</div>
</div>
</div>
</body>
</html>